grades = [[5, 3, 3, 5, 4], [2, 2, 2, 3], [4, 5, 5, 2], [4, 4, 3], [5, 5, 5, 4, 5]]
students = {'Johnny', 'Bilbo', 'Steve', 'Khendrik', 'Aaron'}
a = [5, 3, 3, 5, 4] #присвакваем каждому значению имя переменной для преобращования
b = [2, 2, 2, 3]
c = [4, 5, 5, 2]
d = [4, 4, 3]
e = [5, 5, 5, 4, 5]
grades1 = [a, b, c, d, e] # получили новый перечень
grades2 = sum(a)/len(a), sum(b)/len(b), sum(c)/len(c),sum(d)/len(d), sum(e)/len(e)
# находим среднее арифметическое каждого значения
students1 = sorted(students) # сортируем каждое значение из snudents по алфавиту
sum_ = dict(zip(students1, grades2)) # присваиваем каждому имени студента свой средний балл
print(sum_) # печать результата
